<template>
  <div class="profile__content-questions">
    <div class="profile__content-questions_wrapper">
      <div
        class="profile__content-questions_item"
        v-for="(item, id) in question"
        :key="id"
        :class="{ active: id == index }"
        @click="index == id ? (index = null) : (index = id)"
      >
        <div class="profile__content-questions_icon">
          <img src="@/assets/images/profile/message-icon.svg" alt="" />
        </div>
        <div class="profile__content-questions_content">
          <div class="profile__content-questions_title">
            {{ item.title }}
          </div>
          <p class="profile__content-questions_text">
            {{ item.text }}
          </p>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data: () => {
    return {
      question: [
        {
          title: 'Где я могу получить еще больше информации?',
          text: `У нас есть блог, страница на Facebook, а в ближайшее время появятся
          страницы и в других социальных сетях! Также мы будем регулярно
          рассылать пресс-релизы, как только у нас будет обновляться лента
          новостей. Так что, чтобы ничего не пропустить, подписывайтесь на нашу
          рассылку. И вы всегда сможете с нами связаться (по электронной почте).`,
        },
        {
          title: 'Могу ли я использовать ваш контент на своем сайте?',
          text: `У нас есть блог, страница на Facebook, а в ближайшее время появятся
          страницы и в других социальных сетях! Также мы будем регулярно
          рассылать пресс-релизы, как только у нас будет обновляться лента
          новостей. Так что, чтобы ничего не пропустить, подписывайтесь на нашу
          рассылку. И вы всегда сможете с нами связаться (по электронной почте).`,
        },
        {
          title: 'Где еще я могу найти вас в Интернете? Facebook, Twitter?',
          text: `У нас есть блог, страница на Facebook, а в ближайшее время появятся
          страницы и в других социальных сетях! Также мы будем регулярно
          рассылать пресс-релизы, как только у нас будет обновляться лента
          новостей. Так что, чтобы ничего не пропустить, подписывайтесь на нашу
          рассылку. И вы всегда сможете с нами связаться (по электронной почте).`,
        },
        {
          title: 'Могу ли я использовать ваш контент на своем сайте?',
          text: `У нас есть блог, страница на Facebook, а в ближайшее время появятся
          страницы и в других социальных сетях! Также мы будем регулярно
          рассылать пресс-релизы, как только у нас будет обновляться лента
          новостей. Так что, чтобы ничего не пропустить, подписывайтесь на нашу
          рассылку. И вы всегда сможете с нами связаться (по электронной почте).`,
        },
        {
          title: 'Когда работы над сайтом будут завершены?',
          text: `У нас есть блог, страница на Facebook, а в ближайшее время появятся
          страницы и в других социальных сетях! Также мы будем регулярно
          рассылать пресс-релизы, как только у нас будет обновляться лента
          новостей. Так что, чтобы ничего не пропустить, подписывайтесь на нашу
          рассылку. И вы всегда сможете с нами связаться (по электронной почте).`,
        },
        {
          title: 'А еще я могу найти вас в Интернете? Facebook, Twitter?',
          text: `У нас есть блог, страница на Facebook, а в ближайшее время появятся
          страницы и в других социальных сетях! Также мы будем регулярно
          рассылать пресс-релизы, как только у нас будет обновляться лента
          новостей. Так что, чтобы ничего не пропустить, подписывайтесь на нашу
          рассылку. И вы всегда сможете с нами связаться (по электронной почте).`,
        },
        {
          title: 'Могу ли я использовать ваш контент на своем сайте?',
          text: `У нас есть блог, страница на Facebook, а в ближайшее время появятся
          страницы и в других социальных сетях! Также мы будем регулярно
          рассылать пресс-релизы, как только у нас будет обновляться лента
          новостей. Так что, чтобы ничего не пропустить, подписывайтесь на нашу
          рассылку. И вы всегда сможете с нами связаться (по электронной почте).`,
        },
      ],
      index: 0,
    }
  },
}
</script>
